#include<bits/stdc++.h>
using namespace std;
int main(){
    freopen("chain.in","r",stdin);
    freopen("chain.out","w",stdout);
    int t;
    cin>>t;
    for(int i=0;i<t;i++)cout<<1<<endl;
}
//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑
//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑
//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑
//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//一等奖//保佑保佑保佑//保佑保佑保佑
//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑
//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑
//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑
//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑//保佑保佑保佑